<a href="https://colab.research.google.com/github/CakeNuthep/Super_AI/blob/master/Data_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Data Analysis**


---
ข้อมูลที่ใช้เป็นข้อมูลการขายของประเทศไทย โดยใช้ Platform ที่ชื่อว่า Facebook 

Data: https://www.kaggle.com/ashishg21/facebook-live-sellers-in-thailand-uci-ml-repo?select=Live.csv

**สิ่งที่ต้องการค้นหา**
- แนวโน้มการใช้วีดีโอ
- แนวโน้มการใข้รูปภาพ
- สิ่งที่มีผลต่อ การ แชร์
- สิ่งที่มีผลต่อ การ comment

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Live.csv')

In [3]:
df

                              status_id status_type  ... Column3  Column4
0      246675545449582_1649696485147474       video  ...     NaN      NaN
1      246675545449582_1649426988507757       photo  ...     NaN      NaN
2      246675545449582_1648730588577397       video  ...     NaN      NaN
3      246675545449582_1648576705259452       photo  ...     NaN      NaN
4      246675545449582_1645700502213739       photo  ...     NaN      NaN
...                                 ...         ...  ...     ...      ...
7045  1050855161656896_1061863470556065       photo  ...     NaN      NaN
7046  1050855161656896_1061334757275603       photo  ...     NaN      NaN
7047  1050855161656896_1060126464063099       photo  ...     NaN      NaN
7048  1050855161656896_1058663487542730       photo  ...     NaN      NaN
7049  1050855161656896_1050858841656528       photo  ...     NaN      NaN

[7050 rows x 16 columns]

In [4]:
df.head

<bound method NDFrame.head of                               status_id status_type  ... Column3  Column4
0      246675545449582_1649696485147474       video  ...     NaN      NaN
1      246675545449582_1649426988507757       photo  ...     NaN      NaN
2      246675545449582_1648730588577397       video  ...     NaN      NaN
3      246675545449582_1648576705259452       photo  ...     NaN      NaN
4      246675545449582_1645700502213739       photo  ...     NaN      NaN
...                                 ...         ...  ...     ...      ...
7045  1050855161656896_1061863470556065       photo  ...     NaN      NaN
7046  1050855161656896_1061334757275603       photo  ...     NaN      NaN
7047  1050855161656896_1060126464063099       photo  ...     NaN      NaN
7048  1050855161656896_1058663487542730       photo  ...     NaN      NaN
7049  1050855161656896_1050858841656528       photo  ...     NaN      NaN

[7050 rows x 16 columns]>

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7050 entries, 0 to 7049
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   status_id         7050 non-null   object
 1   status_type       7050 non-null   object
 2   status_published  7050 non-null   object
 3   num_reactions     7050 non-null   int64
 4   num_comments      7050 non-null   int64
 5   num_shares        7050 non-null   int64
 6   num_likes         7050 non-null   int64
 7   num_loves         7050 non-null   int64
 8   num_wows          7050 non-null   int64
 9   num_hahas         7050 non-null   int64
 10  num_sads          7050 non-null   int64
 11  num_angrys        7050 non-null   int64
dtypes: int64(9), object(3)
memory usage: 661.1+ KB

In [5]:
df.isna().sum()

status_id              0
status_type            0
status_published       0
num_reactions          0
num_comments           0
num_shares             0
num_likes              0
num_loves              0
num_wows               0
num_hahas              0
num_sads               0
num_angrys             0
Column1             7050
Column2             7050
Column3             7050
Column4             7050
dtype: int64

In [7]:
# drop colum Column1,Column2,Column3,Column4
df.drop(['Column1','Column2','Column3','Column4'],
  axis='columns', inplace=True)

In [8]:
df

                              status_id status_type  ... num_sads  num_angrys
0      246675545449582_1649696485147474       video  ...        1           0
1      246675545449582_1649426988507757       photo  ...        0           0
2      246675545449582_1648730588577397       video  ...        0           0
3      246675545449582_1648576705259452       photo  ...        0           0
4      246675545449582_1645700502213739       photo  ...        0           0
...                                 ...         ...  ...      ...         ...
7045  1050855161656896_1061863470556065       photo  ...        0           0
7046  1050855161656896_1061334757275603       photo  ...        0           0
7047  1050855161656896_1060126464063099       photo  ...        0           0
7048  1050855161656896_1058663487542730       photo  ...        0           0
7049  1050855161656896_1050858841656528       photo  ...        0           0

[7050 rows x 12 columns]

In [11]:
len(df.status_id.unique()) # status_id not uniq

6997

In [12]:
df.describe()

       num_reactions  num_comments  ...     num_sads   num_angrys
count    7050.000000   7050.000000  ...  7050.000000  7050.000000
mean      230.117163    224.356028  ...     0.243688     0.113191
std       462.625309    889.636820  ...     1.597156     0.726812
min         0.000000      0.000000  ...     0.000000     0.000000
25%        17.000000      0.000000  ...     0.000000     0.000000
50%        59.500000      4.000000  ...     0.000000     0.000000
75%       219.000000     23.000000  ...     0.000000     0.000000
max      4710.000000  20990.000000  ...    51.000000    31.000000

[8 rows x 9 columns]

In [13]:
df.status_type.unique()

array(['video', 'photo', 'link', 'status'], dtype=object)

In [20]:
#สันนิษฐานว่า จำนวน reactions ต้องเท่ากับ ผลบวกของ num_likes, num_loves,num_wows,num_hahas,num_sads,num_angrys
sum_colum = df.num_likes + df.num_loves+df.num_wows+df.num_hahas+df.num_sads+df.num_angrys
(sum_colum == df.num_reactions).count() # แสดงว่าสันนิษฐาน ถูกต้อง

7050